Revit 2027 API
Document.Print(ViewSet, View) Method
Prints a set of views with a specified view template and default print settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Print(
	ViewSet views,
	View viewTemplate
)
Public Sub Print (
	views As ViewSet,
	viewTemplate As View
)
public:
void Print(
	ViewSet^ views,
	View^ viewTemplate
)
member Print :
        views : ViewSet *
        viewTemplate : View -> unit
Parameters
views ViewSet
The set of views which need to be printed.
viewTemplate View
The view template which apply to the set of views.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when printing is not allowed in the current application mode. Or when at least one view from the view set is not a printable view.
ArgumentNullException | Thrown when the view set to be printed is null.
ArgumentException | Thrown when the view set contains a null element.
ApplicationException | Thrown when at least one view from the view set could not be printed.
OperationCanceledException | Thrown when print is cancelled by event handler.
Remarks
If one view in the set can not be printed successfully then an exception will be thrown.
See Also
Reference
Document Class
Print Overload
Autodesk.Revit.DB Namespace